{
  "awards": [],
  "basics": {
    "email": "pitecus@gmail.com",
    "label": "Frontend + DevOps",
    "location": {
      "address": "",
      "city": "Wayne",
      "countryCode": "US",
      "postalCode": "",
      "region": "New Jersey"
    },
    "name": "Leonardo Meirelles",
    "phone": "(770) 298-3632",
    "picture": "leo-meirelles.jpeg",
    "pronoun": "he/him",
    "profiles": [
      {
        "network": "Twitter",
        "url": "https://twitter.com/eyeeyesir",
        "username": "@eyeeyesir"
      },
      {
        "network": "LinkedIn",
        "url": "https://www.linkedin.com/in/leo-meirelles/",
        "username": "Leo Meirelles"
      },
      {
        "network": "GitHub",
        "url": "https://github.com/pitecus",
        "username": "pitecus"
      }
    ],
    "summary": "Passionate for quality, best practices, and effortless usability (for developers and end-users), problem-solving-oriented engineer with experience in UI/UX, continuous delivery and integration, micro-frontend and microservices architecture, and containers. Quickly adapt to changes in dynamic environments and requirements to provide the optimal solution.",
    "website": "https://pitecus.github.io"
  },
  "education": [
    {
      "area": "Computer Science",
      "courses": [],
      "endDate": "2004-08-14",
      "gpa": "",
      "institution": "Pontifícia Universidade Católica",
      "startDate": "1998-07-06",
      "studyType": "Bachelor"
    }
  ],
  "interests": [],
  "languages": [
    {
      "fluency": "Fluent",
      "language": "English"
    },
    {
      "fluency": "Native speaker",
      "language": "Portuguese"
    }
  ],
  "publications": [
    {
      "name": "GitOps + Ferris Wheel",
      "publisher": "ADP Global Product & Development Connect",
      "releaseDate": "2020-09-30",
      "summary": "GitOps is a process of how to have your whole application (development, infrastructure, releases, deployments, and changelog) in BitBucket. It may sound too extreme, but developers and DevOps are using Bitbucket daily already. It takes advantage of existing tools to automate everything so that everyone can focus on what matters: new features and stability. Since we adopted the GitOps process, we are at 700+ releases, 0 downtime deployments, with rollback happening in minutes. The right people approve new releases without having to send emails or text messages. Most importantly, it keeps track of changes that allow quick troubleshooting by knowing when they happened.",
      "website": "https://tech.adp.com/2020/11/20/adps-annual-developers-conference-video"
    },
    {
      "name": "CI/CD at ADP: Going Global with GitOps",
      "publisher": "ADP Tech & Innovation Blog",
      "releaseDate": "2020-09-30",
      "summary": "Leo Meirelles (Principal Software Engineer) discusses the continuous integration and development (CI/CD) process he implemented with his team.",
      "website": "https://tech.adp.com/2021/09/27/ci-cd-at-adp-going-global-with-gitops/"
    }
  ],
  "references": [],
  "skills": [
    {
      "keywords": [
        "Angular",
        "TypeScript",
        "React",
        "NestJS",
        "Javascript",
        "User Interface (UI)",
        "User Experience (UX)",
        "JSON",
        "CSS",
        "HTML",
        "XML",
        "RestFul API",
        "GraphQL"
      ],
      "level": "Master",
      "name": "Development"
    },
    {
      "keywords": [
        "DevSecOps",
        "AWS",
        "Jenkinsfile",
        "Splunk",
        "Ansible",
        "AWS IAM roles",
        "AWS Cloudformation",
        "AWS API Gateway",
        "AWS Load Balancer",
        "AWS Lambda",
        "GCP CloudRun"
      ],
      "level": "Master",
      "name": "DevOps"
    },
    {
      "keywords": [
        "Cross-Origin Resource Sharing (CORS)",
        "Content-Security-Policy (CSP)"
      ],
      "level": "Master",
      "name": "Security"
    },
    {
      "keywords": [
        "Docker",
        "Docker swarm",
        "Kubernetes",
        "Dockerfile",
        "docker-compose",
        "helm charts",
        "distroless"
      ],
      "level": "Master",
      "name": "Containers"
    },
    {
      "keywords": [
        "Linux",
        "TCP/IP",
        "Network",
        "DNS",
        "awk",
        "sed",
        "bash",
        "curl",
        "NGINX",
        "Nest"
      ],
      "level": "Master",
      "name": "Linux"
    },
    {
      "keywords": [
        "Microservices",
        "Micro-frontend",
        "Webpack"
      ],
      "level": "Master",
      "name": "Architecture"
    },
    {
      "keywords": [
        "Sketch",
        "Lucidchart",
        "Jenkins",
        "SonarQube",
        "Artifactory",
        "Google Analytics",
        "Splunk",
        "Instana",
        "LogRocket"
      ],
      "level": "Master",
      "name": "Applications"
    }
  ],
  "volunteer": [],
  "work": [
    {
      "company": "ADP",
      "endDate": "Current",
      "highlights": [
        "Reverse-engineered an Adobe Flash application with XML/SOAP API and replaced it with a new web application with a small team under a tight deadline. Integrated cross-browsing tests using SauceLabs with the ADP's CI/CD framework using VPN reverse-proxies and side-car containers.",
        "Building a proof-of-concept application to recognize payroll documents misdeliveries using images from PDF documents. It prevents security incidents for clients and employees; while allowing seamless integrations across multiple payroll services."
      ],
      "position": "Principal Architect",
      "startDate": "2018-09-21",
      "summary": "Design and build full-stack applications; create, audit, and deploy containers. Improve security, advocate for automated tests, and optimize release workflow.",
      "website": "https://www.adp.com"
    },
    {
      "company": "ADP",
      "endDate": "2018-09-21",
      "highlights": [
        "Lead the frontend engineer team on a multi-country payroll application. I provided guidance and direction to multiple co-workers in multiple geographic locations. Engaged in UI/UX reviews, prioritized features and, facilitated the development between teams. Enforced code standards, performed code reviews, and helped with unit tests. Built containers and implemented a CI/CD pipeline for deployments in 4 different environments.",
        "Improved existing CI/CD pipeline using GitOps. Automated the approval process of releases, improved the deployment time (from 30 to 3 minutes), and optimized the build by updating only the necessary services (from 40 to 10 minutes)."
      ],
      "position": "Principal Software Engineer",
      "startDate": "2016-10-01",
      "summary": "Lead UI/UX + DevOps engineers for an application to integrate multi-country payroll systems with human capital management.",
      "website": "https://www.adp.com"
    },
    {
      "company": "Google",
      "endDate": "2016-10-01",
      "highlights": [
        "Architected, designed, and integrated AngularJS 1.4 components for Cloud SQL inside Google Cloud Platform. Used Google Analytics to improve user experience by evaluating and prioritizing features.",
        "Coordinated with Google Site Reliability Engineering, project manager, and backend API team to prioritize bugs, features, and releases using feature flags experiments. Built utility tools in Shell script, NodeJS, and Chrome Extensions for internal usage."
      ],
      "position": "Senior Software Engineer",
      "startDate": "2015-05-04",
      "summary": "Engineered frontend components, working with API integrations and releases of new features.",
      "website": "https://www.google.com"
    },
    {
      "company": "The New York Times",
      "endDate": "2015-04-30",
      "highlights": [
        "Create new features, improve system performance and develop new applications in the Business Intelligence analytics ecosystem. Develop software prototypes to streamline data access. Responsible for tag management and tracking systems for page and modules views, customer behavior, A/B testings, and subscription funnel.",
        "Used MEAN stack (MongoDB, Express, Angular, and Node.JS) to enhanced user behavior data tracking. Created applications for user-friendly interaction with REST services. Worked together with multiple stakeholders to prioritize features and manage development cycles."
      ],
      "position": "Senior Software Engineer",
      "startDate": "2013-06-01",
      "summary": "Developed frontend features, integrating with API and Business Intelligence tools, interpreting user behavior.",
      "website": "https://www.nytimes.com"
    },
    {
      "company": "The New York Times",
      "endDate": "2013-06-01",
      "highlights": [
        "Designed the architecture for the NYTimes-China website: planned the infrastructure, built the servers, and successfully transitioned to the implementation team. Developed SEO (search engine optimization) features using ModEST publishing framework. Worked on Datacenter Move (DCI) project, providing solutions for server configurations migration between iPlanet and Apache.",
        "Fixed issues and developed new features for the NY Times website. Responsible for performance, stability, and improvement of hundreds of servers in Production in two Datacenters (East and West) with millions of daily page views."
      ],
      "position": "Web Engineer",
      "startDate": "2011-10-17",
      "summary": "DevOps, Production Support, frontend development, performance improvements",
      "website": "https://www.nytimes.com"
    },
    {
      "company": "ADP",
      "endDate": "2011-10-14",
      "highlights": [
        "Architected and designed reusable components using Dojo, Java, and Javascript. Developed UI web frontend, middle-tier JSF to provide communication, security, and performance to Web Services using SOAP. Generated code with cross-browser compatibility for Firefox, Internet Explorer (7, 8, and 9), and Safari.",
        "Created new features, advised about performance improvements and usability with business and analysis teams. Reviewed UI under development and built web applications under tight deadlines, with high availability, low resources usage, security, and performance."
      ],
      "position": "Lead Technical Analyst",
      "startDate": "2008-12-08",
      "summary": "Fullstack developer with Java and Javascript. Cross-browser compatibility. Performance improvements.",
      "website": "https://www.adp.com"
    },
    {
      "company": "ADP",
      "endDate": "2008-12-08",
      "highlights": [
        "Provided 3rd level support to ADP Portal in the United States. The ADP Portal was build using Java. It had more than 5 million active users with an average of 2 million daily hits, providing one interface to many enterprise products.",
        "Was responsible for administration and monitoring of several servers in production and pre-production environments, troubleshoot, and coordinated teams to fix issues efficiently. Helped other co-workers to configure, maintain, and troubleshoot WebSphere Portal environments. Fixed security issues found during penetration tests."
      ],
      "position": "Senior programmer",
      "startDate": "2006-11-01",
      "summary": "Production support, release management, coordinate troubleshooting cross-teams",
      "website": "https://www.adp.com.br"
    },
    {
      "company": "ADP",
      "endDate": "2006-11-01",
      "highlights": [
        "Strived as a software developer for an application to support US human resources, payroll, vacations, and benefits. It uses Java Server Pages and Struts framework, with the frontend running inside WebSphere Portal. Created unit and integration tests."
      ],
      "position": "Programmer",
      "startDate": "2005-04-11",
      "summary": "Fullstack developer Java developer.",
      "website": "https://www.adp.com.br"
    }
  ]
}