{
  "awards": [],
  "basics": {
    "email": "pitecus@gmail.com",
    "label": "Frontend + DevOps",
    "location": {
      "address": "",
      "city": "Wayne",
      "countryCode": "US",
      "postalCode": "",
      "region": "New Jersey"
    },
    "name": "Leonardo Meirelles",
    "phone": "(770) 298-3632",
    "picture": "leo-meirelles.jpeg",
    "pronoun": "he/him",
    "profiles": [
      {
        "network": "Twitter",
        "url": "https://twitter.com/eyeeyesir",
        "username": "@eyeeyesir"
      },
      {
        "network": "LinkedIn",
        "url": "https://www.linkedin.com/in/leo-meirelles/",
        "username": "Leo Meirelles"
      }
    ],
    "summary": "Passionate for quality, best practices, and effortless usability (for developers and end users), problem solving oriented engineer with experience in UI/UX, continuous delivery and integration, micro-frontend and microservices architecture, and containers. Quick to adapt to changes of dynamic environments and requirements to provide the optimal solution.",
    "website": "https://pitecus.github.io"
  },
  "education": [
    {
      "area": "Computer Science",
      "courses": [],
      "endDate": "2004-08-14",
      "gpa": "",
      "institution": "Pontifícia Universidade Católica (PUCRS)",
      "startDate": "1998-07-06",
      "studyType": "Bachelor"
    }
  ],
  "interests": [],
  "languages": [
    {
      "fluency": "Bilingual",
      "language": "English"
    },
    {
      "fluency": "Native speaker",
      "language": "Portugues"
    }
  ],
  "publications": [
    {
      "name": "GitOps + Ferris Wheel",
      "publisher": "ADP Global Product & Development Connect",
      "releaseDate": "2020-09-30",
      "summary": "CI/CD backed by Bitbucket. It allows to have one single source of truth, process transparency, and auditing in one single place. Environment configuration, release approvals and notifications, clear process and responsibilities – all in one single place, accessible to everyone and traceable. And a rollback is just a Pull-Request away.",
      "website": "https://tech.adp.com/2020/11/20/adps-annual-developers-conference-video"
    }
  ],
  "references": [],
  "skills": [
    {
      "keywords": [
        "User Interface",
        "User Experience",
        "Angular",
        "TypeScript",
        "Javascript",
        "JSON",
        "CSS",
        "HTML",
        "XML",
        "Google Analytics",
        "ReactJS",
        "Lambda functions"
      ],
      "level": "Master",
      "name": "Frontend/Backend"
    },
    {
      "keywords": [
        "Linux",
        "Docker swarm",
        "Containers",
        "Kubernetes",
        "TCP/IP",
        "Network",
        "DevSecOps",
        "AWS",
        "AWS Cloudformation, Lambda, API Gateway",
        "Jenkinsfile",
        "Splunk",
        "Instana",
        "AWS API Gateway",
        "AWS Load balancer"
      ],
      "level": "Master",
      "name": "DevOps"
    },
    {
      "keywords": [
        "Microservices",
        "Micro-frontend"
      ],
      "level": "Master",
      "name": "Architecture"
    },
    {
      "keywords": [
        "Sketch",
        "Lucidchart",
        "Jenkins",
        "SonarQube",
        "Artifactory"
      ],
      "level": "Master",
      "name": "Applications"
    }
  ],
  "volunteer": [],
  "work": [
    {
      "company": "ADP",
      "endDate": "Current",
      "highlights": [
        "Lead the GitOps implementation for CI/CD SDLC integrated with code review, SonarQube, automated releases using containers and deployments. Work on DevSecOps by scanning containers for vulnerabilities and npm audits for Javascript projects. Improve the continuous E2E cross-browser tests using SauceLabs, integrating with internal automation services using container sidecar and VPN/proxy connections.",
        "Architected and replaced an Adobe Flash application using Business Objects Enterprise XML APIs by Angular 11 and HighCharts. Working on an application to identify incorrect paychecks using AWS Lambda (backend), DynamoDB, SQS, S3, and Kubernetes Helm Charts (frontend)"
      ],
      "position": "Principal Architect",
      "startDate": "2018-09-21",
      "summary": "Design, build, audit, and deploy containerized applications. Architect integration solutions. Improve security and optmize release cycles.",
      "website": "https://www.adp.com"
    },
    {
      "company": "ADP",
      "endDate": "2018-09-21",
      "highlights": [
        "Worked with Product Owners, Project Managers, and multiple teams in different countries to delivery bi-weekly features, coordinating dependencies and requirements. Containerized micro-frontend and micro-services for faster release cycle.",
        "Advocate for meaninful code reviews, small pull requests, automated code quality with lint, SonarQube and unit-tests. Upgrade the application from AngularJS 1.4 to Angular 6 by running both at the same time."
      ],
      "position": "Principal Software Engineer",
      "startDate": "2016-10-01",
      "summary": "Lead UI/UX + DevOps enginner for an application to integrate multi-country payroll systems with human capital management.",
      "website": "https://www.adp.com"
    },
    {
      "company": "Google",
      "endDate": "2016-10-01",
      "highlights": [
        "Architect, design and integrate AngularJS 1.4 components for Cloud SQL inside Google Cloud Platform. Use Google Analytics to improve user experience by evaluating and prioritizing features.",
        "Coordinate with Google Site Reliability Engineering, project manager and back-end API team to prioritize bugs, features and release using experiments. Provide support for internal and external users. Create utility tools in Bash shell script, NodeJS and Chrome Extensions for internal usage."
      ],
      "position": "Senior Software Engineer",
      "startDate": "2015-05-04",
      "summary": "Frontend development, API integration, release new features",
      "website": "https://www.google.com"
    },
    {
      "company": "The New York Times",
      "endDate": "2015-04-30",
      "highlights": [
        "Create new features, improve system’s performance and develop new applications in Business Intelligence analytics ecosystem. Develop software prototypes to streamline data access. Responsible for tag management and tracking systems for page and modules views, customer behavior, A/B testings, and subscription funnel.",
        "Develop in MEAN stack. Enhance tracking data through systems integration. Create front-end applications for user friendly interaction with REST services. Partner with multiple stakeholders to prioritize features and manage development cycles."
      ],
      "position": "Senior Software Engineer",
      "startDate": "2013-06-01",
      "summary": "Frontend development, API integration, Business Inteligence, user behavior analysis",
      "website": "https://www.nytimes.com"
    },
    {
      "company": "The New York Times",
      "endDate": "2013-06-01",
      "highlights": [
        "System architect for NYTimes-China site: planned the infra-structure, built the servers and successfully transitioned to the implementation team. Developed SEO (search engine optimization) features using ModEST publishing framework. Worked on Datacenter Move (DCI) project, providing solutions for server configurations migration between iPlanet and Apache.",
        "Provided support and development for NY Times web site. Responsible for performance, stability and improvement of hundreds of servers in Production in two Datacenters (East and West) with millions of daily page views."
      ],
      "position": "Web Engineer",
      "startDate": "2011-10-17",
      "summary": "DevOps, Production Support, frontend development, performance improvements",
      "website": "https://www.nytimes.com"
    },
    {
      "company": "ADP",
      "endDate": "2011-10-14",
      "highlights": [
        "Architect and design reusable components using Dojo, Java and Javascript. Develop UI web front ends, middle tier JSF to provide communication, security and performance to Web Services using SOAP. Generate code with cross browser compatibility for Firefox, Internet Explorer (7, 8 and 9) and Safari.",
        "Provided analysis of new product features, advice about performance improvements and usability with business and analysis teams, review UI under development and create web applications in tight deadlines, with emphasis in high availability, low resources usage, security and performance."
      ],
      "position": "Lead Technical Analyst",
      "startDate": "2008-12-08",
      "summary": "Full stack development with Java and Javascript. Cross browser compatibility. Performance improvements.",
      "website": "https://www.adp.com"
    },
    {
      "company": "ADP",
      "endDate": "2008-12-08",
      "highlights": [
        "Provided 3rd level support to ADP US Portal. The ADP Portal was developed under J2EE and had more than 5 millions of active users with an average of 2 millions of daily hits, providing a common interface to many enterprise products.",
        "Responsible for administration and monitoring of several production and pre-production servers, troubleshoot and coordinate teams to fix issues efficiently. Provided technical support for other teams regarding WebSphere Portal environment and fixed security issues found during penetration tests."
      ],
      "position": "Senior programmer",
      "startDate": "2006-11-01",
      "summary": "Production support, release management, coordinate troubleshooting cross-teams",
      "website": "https://www.adp.com.br"
    },
    {
      "company": "ADP",
      "endDate": "2006-11-01",
      "highlights": [
        "Developed and designed using Scrum methodology a product tailored for US human resources, including payroll, vacations and benefits. The system was based in JSP and Struts, with the front-end running inside WebSphere Portal. Used jUnit tests for reliability, quality and integration tests."
      ],
      "position": "Programmer",
      "startDate": "2005-04-11",
      "summary": "Java developer, unit tests.",
      "website": "https://www.adp.com.br"
    }
  ]
}